<?php

/**
 * 创建型模式:
 *
 * 单例    @see SingletonPattern 保证一个类仅有一个实例，并提供一个访问它的全局访问点。
 * 工厂方法 @see FactoryMethodPattern 定义一个用于创建对象的接口，让子类决定实例化哪一个类，工厂模式使一个类的实例化延迟到其子类。
 * 抽象工厂 @see AbstractFactoryPattern 提供一个创建一系列或相关依赖对象的接口，而无需指定它们具体的类。
 * 建造者  @see BuilderPattern 将一个复杂对象的构建与它的表示分离，使得同样的构建过程可以创建不同的表示。
 * 原型    @see PrototypePattern 用原型实例指定创建对象的种类，并且通过拷贝这些原型创建新的对象。
 *
 * 结构型模式:
 *
 * 适配器  @see AdapterPattern 将一个类的接口转换成客户希望的另外一个接口。使得原本由于接口不兼容而不能一起工作的那些类可以一起工作。
 * 桥接   @see BridgePattern 将抽象部分与它的实现部分分离，使得它们都可以独立地变化。
 * 组合   @see CompositePattern 将对象组合成树状结构以表示'部分-整体'的层次结构。组合模式是的用户对单个对象和组合对象的使用具有一致性。
 * 装饰   @see DefinitionPattern 动态地给一个对象增加一些额外的职责，就增加对象功能来说，装饰模式比生成子类实现更为灵活。
 * 外观   @see FacadePattern 外部与一个子系统的通信必须通过一个统一的外观对象进行
 * 享元   @see FlyweightPattern 运用共享技术有效地支持大量细粒度对象的复用。
 * 代理   @see ProxyPattern 为其他对象提供一种代理以控制对这个对象的访问。
 *
 * 行为型模式：
 *
 * 观察者   @see ObserverPattern 定义对象间的一种一对多依赖关系，使得每当一个对象状态发生改变时，其相关依赖对象皆得到通知并被自动更新。
 * 模版方法 @see TemplateMethodPattern 定义一个操作中的算法的骨架，而将一些步骤延迟到子类中。模板方法使得子类可以不改变一个算法的结构即可重定义该算法的某些特定步骤。
 * 命令    @see CommandPattern 将一个请求封装为一个对象，从而使你可用不同的请求对客户进行参数化；对请求排队或记录请求日志，以及支持可撤销的操作。
 * 状态    @see StatePattern 当一个对象的内在状态改变时允许改变其行为，这个对象看起来像是改变了其类。
 * 职责链  @see ChainOfResponsibility 使多个对象都有机会处理请求，从而避免请求的发送者和接收者之间的耦合关系。将这个对象连成一条链，并沿着这条链传递该请求，直到有一个对象处理它为止。
 * 解释器  @see InterpreterPattern 给定一个语言，定义它的文法的一种表示，并定义一个解释器，这个解释器使用该表示来解释语言中的句子。
 * 中介者  @see MediatorPattern 用一个中介对象来封装一系列的对象交互，中介者使各对象不需要显式地相互引用，从而使其耦合松散，而且可以独立地改变它们之间的交互。
 * 访问者  @see VisitorPattern 表示一个作用于某对象结构中的各元素的操作。它使你可以在不改变各元素的前提下定义作用于这些元素的操作。
 * 策略   @see StrategyPattern 定义了一系列的算法，并将每一个算法封装起来，使每个算法可以相互替代，使算法本身和使用算法的客户端分割开来，相互独立。
 * 备忘录  @see MementoPattern 在不破坏封装性的前提下，捕获一个对象的内部状态，并在该对象之外保存这个状态。这样以后就可将该对象恢复到原先保存的状态。
 * 迭代器  @see IteratorPattern 提供一种方法顺序访问一个聚合对象中各个元素，而又不暴露该对象的内部表示。
 */